Rails/99CatsProject/NinetyNineCats/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_user
    if session[:user_id]
      @curUser = User.find(session[:user_id])