Rails/99CatsProject/NinetyNineCats/app/controllers/cats_controller.rb

SELECT "rental_requests".* FROM "rental_requests" WHERE "rental_requests"."cat_id" = $1  [["cat_id", 3]]
---
  def show
    @rentals = RentalRequest.where(cat_id: @cat.id)