Rails/99CatsProject/NinetyNineCats/app/controllers/cats_controller.rb

  def show
    @rentals = RentalRequest.where(cat_id: @cat.id).order(:start_date)
---
SELECT "rental_requests".* FROM "rental_requests" WHERE "rental_requests"."cat_id" = $1 ORDER BY "rental_requests"."start_date" ASC  [["cat_id", 3]]

  def destroy
    if @cat.destroy
---
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 2]]

  def find_cat
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]