Rails/99CatsProject/NinetyNineCats/app/controllers/rental_requests_controller.rb

  def index
    if params[:cat_id]
      @rentals = RentalRequest.where(cat_id: params[:cat_id])
      @subject = Cat.find(params[:cat_id])
    elsif params[:user_id]
      @rentals = RentalRequest.where(user_id: params[:user_id])
      @subject = User.find(params[:user_id])
---
SELECT "rental_requests".* FROM "rental_requests" WHERE "rental_requests"."cat_id" = $1  [["cat_id", 3]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "rental_requests".* FROM "rental_requests" WHERE "rental_requests"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @rq = RentalRequest.new(request_params)

    if @rq.save
---
INSERT INTO "rental_requests" ("cat_id", "user_id", "created_at", "updated_at", "start_date", "end_date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 3], ["user_id", 1], ["created_at", "2020-10-12 23:43:56.283218"], ["updated_at", "2020-10-12 23:43:56.283218"], ["start_date", "2020-10-07"], ["end_date", "2020-10-07"]]

  def approve
    @toApprove = RentalRequest.find(params[:rental_request_id])
---
SELECT  "rental_requests".* FROM "rental_requests" WHERE "rental_requests"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def deny
    @toDeny = RentalRequest.find(params[:rental_request_id])
---
SELECT  "rental_requests".* FROM "rental_requests" WHERE "rental_requests"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]