Rails/99CatsProject/NinetyNineCats/app/controllers/sessions_controller.rb

SELECT  1 AS one FROM "users" LIMIT $1  [["LIMIT", 1]]
---
  def new
    redirect_to new_user_path if User.none?