Rails/ArtShareProj/ArtShare/app/controllers/users_controller.rb

  def index
    if params[:user_info]
      # how do you differentiate between params in the body
      # and params in a query string?
      # does it matter?
      toRender = get_user(params[:user_info])
    else
      toRender = User.all
    end

    if toRender.empty?
---
SELECT "users".* FROM "users"
SELECT  1 AS one FROM "users" LIMIT $1  [["LIMIT", 1]]