Rails/ArtShare/app/controllers/comments_controller.rb

  def index
    if params[:user_id]
      # we want a user's comments
      render json: User.find(params[:user_id]).authored_comments
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 1]]