Rails/ArtShare/app/controllers/users_controller.rb

  def index
    render json: User.all.to_json
---
SELECT "users".* FROM "users"