Rails/ArtShareProj/ArtShare/app/models/comment.rb

  def creator_cannot_critique
    if Artwork.find(artwork_id).artist_id == author_id
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]