Rails/MusicApp/music_app/app/controllers/albums_controller.rb

  def new
    @album = Album.new
    @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)
    @album.band_id = params[:band_id]

    if @album.save
---
INSERT INTO "albums" ("name", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Poetry For Pussy"], ["band_id", 9], ["created_at", "2020-10-17 18:26:21.707591"], ["updated_at", "2020-10-17 18:26:21.707591"]]

  def like
    @album = Album.find(params[:album_id])
    @like = @album.likes.build(likeable_type: "Album", liker_id: current_user.id)

    if @like.save
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "liker_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Album"], ["likeable_id", 8], ["created_at", "2020-10-18 23:31:24.728198"], ["updated_at", "2020-10-18 23:31:24.728198"], ["liker_id", 3]]

  def find_album
    @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]