Rails/MusicApp/music_app/app/controllers/application_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def require_band_membership
    unless Band.find(params[:band_id]).has_member?(current_user)