Rails/MusicApp/music_app/app/controllers/band_memberships_controller.rb

  def invite
    @band = Band.find(params[:band_id])
    @user = User.find_by(email: params[:email])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "parisi.aaron@gmail.com"], ["LIMIT", 1]]

  def create
    @to_add = User.find(params[:user_id])
    if @to_add.nil?
      # user does not exist
      redirect_to band_path(band_id: params[:band_id]), notice: "no user with that e mail"
    else
      @band_membership = BandMembership.new(
        band_id: params[:id],
        member_id: @to_add.id
      )

      if @band_membership.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "band_memberships" ("band_id", "member_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["band_id", 11], ["member_id", 2], ["created_at", "2020-10-19 05:36:00.279909"], ["updated_at", "2020-10-19 05:36:00.279909"]]

  def destroy
    @to_destroy = BandMembership.find_by_credentials(
      params[:band_id].to_i,
      params[:member_id].to_i
    )

    if @to_destroy.nil?
      redirect_to root_path, notice: "this should not happen, something is wrong"
    else
      if @to_destroy.destroy
---
DELETE FROM "band_memberships" WHERE "band_memberships"."id" = $1  [["id", 2]]