Rails/MusicApp/music_app/app/controllers/band_memberships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "fake@fake.com"], ["LIMIT", 1]]
---
  def create
    @to_add = User.find_by(email: params[:email])