Rails/MusicApp/music_app/app/controllers/bands_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"
---
  def index
    if params[:user_id]
      # index page for bands a user's bands
      @bands = User.find(params[:user_id]).bands
    else
      @bands = Band.all

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Maximum Wage"], ["created_at", "2020-10-17 18:22:14.740654"], ["updated_at", "2020-10-17 18:22:14.740654"]]
INSERT INTO "band_memberships" ("band_id", "member_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["band_id", 9], ["member_id", 2], ["created_at", "2020-10-17 18:25:13.225506"], ["updated_at", "2020-10-17 18:25:13.225506"]]
---
  def create
    @band = Band.new(band_params)

    if @band.save
      @band.band_memberships.build(
        band_id: @band.id,
        member_id: params[:user_id],
        instrument: params[:instrument]
      ).save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "liker_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Band"], ["likeable_id", 11], ["created_at", "2020-10-18 23:26:11.481584"], ["updated_at", "2020-10-18 23:26:11.481584"], ["liker_id", 3]]
---
  def like
    @band = Band.find(params[:band_id])
    @like = @band.likes.build(likeable_type: "Band", liker_id: current_user.id)

    if @like.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def find_band
    @band = Band.find(params[:id])