Rails/MusicApp/music_app/app/controllers/likes_controller.rb

  def create
    @like = Like.new(
      # band_id: params[:band_id]
      liker_id: current_user.id
    )

    if params[:band_id]
      @like.likeable_id = params[:band_id]
      @like.likeable_type = "Band"
    elsif params[:album_id]
      @like.likeable_id = params[:album_id]
      @like.likeable_type = "Album"
    else
      @like.likeable_id = params[:track_id]
      @like.likeable_type = "Track"
    end

    if @like.save
---
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "liker_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Band"], ["likeable_id", 11], ["created_at", "2020-10-18 22:31:26.449180"], ["updated_at", "2020-10-18 22:31:26.449180"], ["liker_id", 3]]