Rails/MusicApp/music_app/app/controllers/sessions_controller.rb

  def new
    if User.all.empty?
---
SELECT  1 AS one FROM "users" LIMIT $1  [["LIMIT", 1]]