Rails/MusicApp/music_app/app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @track = Album.where(album_id: params[:album_id])
    @album = Album.find(params[:album_id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @track = Track.new
    @album = Album.find(params[:album_id])

INSERT INTO "tracks" ("name", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "In the Flesh?"], ["album_id", 1], ["created_at", "2020-10-17 02:29:48.821495"], ["updated_at", "2020-10-17 02:29:48.821495"]]
---
  def create
    @track = Track.new(track_params)
    @track.album_id ||= params[:album_id]

    if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "liker_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Track"], ["likeable_id", 6], ["created_at", "2020-10-18 23:32:19.305446"], ["updated_at", "2020-10-18 23:32:19.305446"], ["liker_id", 3]]
---
  def like
    @track = Track.find(params[:track_id])
    @like = @track.likes.build(likeable_type: "Track", liker_id: current_user.id)

    if @like.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_track
    @track = Track.find(params[:id])