Rails/MusicApp/music_app/app/controllers/users_controller.rb

  def index
    if params[:band_id]
      @band = Band.find(params[:band_id])
      @users = @band.members
    else
      @users = User.all
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "session_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def confirm_auth
      @user.authenticated = true
      if @user.save
---
UPDATE "users" SET "authenticated" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["authenticated", true], ["updated_at", "2020-10-19 17:56:41.407925"], ["id", 10]]