Rails/99CatsProject/NinetyNineCats/app/models/rental_request.rb

UPDATE "rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-10-13 20:44:30.672632"], ["id", 8]]
SELECT "rental_requests".* FROM "rental_requests" WHERE "rental_requests"."cat_id" = $1  [["cat_id", 3]]
---
  def approve!
    ActiveRecord::Base.transaction do
      self.update(status: 'APPROVED')

      self.overlapping_pending_requests.each { |req| req.deny! }

UPDATE "rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-10-13 20:52:44.960871"], ["id", 12]]
---
  def deny!
    self.update(status: 'DENIED')

SELECT "rental_requests".* FROM "rental_requests" WHERE "rental_requests"."cat_id" = $1 AND ('2024-01-05' < start_date and '2024-06-23' > start_date OR '2024-01-05' BETWEEN start_date and end_date) AND "rental_requests"."id" != $2 AND "rental_requests"."status" = $3  [["cat_id", 3], ["id", 8], ["status", "PENDING"]]
SELECT  1 AS one FROM "rental_requests" WHERE "rental_requests"."cat_id" = $1 AND ('2021-03-16' < start_date and '2025-10-13' > start_date OR '2021-03-16' BETWEEN start_date and end_date) AND "rental_requests"."id" != $2 AND "rental_requests"."status" = $3 LIMIT $4  [["cat_id", 3], ["id", 9], ["status", "APPROVED"], ["LIMIT", 1]]
---
  def cat_is_available
    if self.status == 'APPROVED' && ! self.overlapping_approved_requests.empty?