Rails/MusicApp/music_app/app/models/band_membership.rb

SELECT  "band_memberships".* FROM "band_memberships" WHERE "band_memberships"."band_id" = $1 AND "band_memberships"."member_id" = $2 ORDER BY "band_memberships"."id" ASC LIMIT $3  [["band_id", 10], ["member_id", 2], ["LIMIT", 1]]
---
  def self.find_by_credentials(band_id, member_id)
    BandMembership.where(band_id: band_id).where(member_id: member_id).first