Rails/MusicApp/music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "parisi.aaron@gmail.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    ret = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zCnhYtg-TN02hlNwi0STyA"], ["updated_at", "2020-10-16 17:01:12.551275"], ["id", 1]]
---
  def reset_session_token
    self.session_token = self.class.generate_session_token
    self.save!