Rails/99CatsProject/NinetyNineCats/app/views/rental_requests/_form.html.erb

SELECT "cats".* FROM "cats"
---
    <%= f.label :cat_id, "Which cat?" %>
    <%= f.collection_select :cat_id, Cat.all, :id, :name, prompt: true %>